package com.ict03.class03;

public class Ex01{
	/*	1. 상속관계 : 클래스와 클래스와의 관계
	 *		-> 자식클래스가 부모클래스의 멤버필드, 멤버메소드를 객체 생성없이, 제약없이 사용할 수 있도록하는 관계.
	 *		형식 : 자식클래스 extends 부모클래스
	 *		특징 : 자바에서는 다중 상속은 불가능하다. -> 부모클래스는 하나만 존재한다. (단, 인터페이스는 예외)
	 *			   모든 클래스는 Object라는 클래스를 상속받고 있다.
	 *		부모클래스 : super / 자식클래스 : sub
	 *
	 *		-> 오버라이딩 : 부모클래스의 메소드를 그대로 가져와 자식클래스가 마음대로 변경해서 사용하는 것을 말한다.
	 *		   (==재정의)	오버라이딩을 하게 되면, 부모메소드는 숨겨진다. (자식클래스에서 변경해 사용하기 때문에)
	 *		 
	 *		 final 메소드 : 오버라이딩을 못하게 하기 위해 부모메소드에서 부여하는 예약어
	 *		 final 클래스 : 상속금지. -> 자식클래스 생성 불가.
	 *		 final 변수	  : 변수를 상수로 지정함 -> 데이터 변경이 불가능해짐.
	 */
}
