package com.ict08.network;

public class Ex05 {
	public static void main(String[] args) {
		//XML : extensible markup language
		/* HTML을 개선하여 만든 언어.
		 * 홈페이지 구축 기능 검색기능이 향상되었고, 웹페이지 편집에서 보다 용이함을 띈다.
		 * HTML은 정해진 태그를 이용해서 웹 페이지를 제작한다.
		 * 
		 * 태그 : <시작 태그 : "값"> 텍스트 </끝태그> 로 구성되어있다.
		 * - HTML의 경우, w3c로부터 태그가 이미 정해져있다.
		 * 
		 * 반면에, XML의 경우,
		 * 사용자가 태그를 만들어 의미를 부여할 수 있다.
		 * XML은 반드시 첫 줄에 <?xml version = "1.0" encoding = "UTF-8" standalone = "no" ?>를 사용해야한다.
		 * XML은 데이터 전달이나 환경설정에 있어서 많이 사용된다.
		 */
		
		/* JSON(JavaScript Object Notation) : "키 - 값 쌍"으로 이루어진 데이터 오브젝트를 전달하기 위해 인간이 읽을 수 있는 덱스트를 사용하는 개방형 표준 포맷.
		 * 
		 * ex) 다음은 한 사람에 관한 정보를 갖는 JSON 객체이다.
		 * 키-값 쌍(이름 : 값) 의 패턴으로 표현된다.
		 * "이름" : "홍길동",												키 : 값
		 * "나이" : 25,														키 : 값
		 * "성별" : "여",													키 : 값
		 * "주소" : "서울시 양천구 목동",									키 : 값
		 * "특기" : ["농구", "도술"],										키 : 값(배열)
		 * "가족관계" : {"#" : 2, "아버지" : "홍판서", "어머니" : "춘섬"}	키 : 값(JSON)
		 */
	}
}
